// "1. Компонент отримує в пропсах children та метод закриття модалки
// 2. Компонент створює блок розмітки що є фоном для отриманих children
// 3. блок children за замовчуванням розміщено по центру, або в іншому місці за допомогою додаткових налаштувань.
// 3. Компонент підключається в DOM через портал
// 4. Компонент має інтерфейс закриття по кліку на бекдроп та натисканню на Escape
// 5. Компонент під час розмонтування чистить за собою всі запущені ним процеси."

export const Modal = () => {
  return <div>Modal</div>;
};
