// "1. Компонент отримує в пропсах початкові дані створюваного завдання та метод закриття модалки.
// 2. Компонент має локальний стейт для полів форми [title, start, end, priority]
// 3. Компонент рендерить блок розмітки з полями створюваної форми.
// 4. Якщо модалка відкрита для редагування завдання, кнопка сабміту повинна називатись Edit.
// 5. По сабміту відбувається запит на бекенд на створення або редагування завдання.
// 6. Успіх - завдання додається в відповідну колекці або змінюється в ній, закривається модалка, завдання відображається в таблиці.
// 7. Помилка - юзеру показується відповідне пушповідомлення
// 8. Клік по кнопці Cancel або кнопці закриття на формі закриває модалку."

export const TaskForm = () => {
  return <div>TaskForm</div>;
};

// "валідація форми:

// title: макс 250 сиволів | обов'язково
// start: формат 09:00 | обов'язково
// end: формат 09:30 | end > time | обов'язково
// priority: [low | medium | high] | обов'язково
// date: формат YYYY-MM-DD | обов'язково
// category: [to-do | in-progress | done] | обов'язково"
