// "1. Компонент рендерить кнопку.
// 2. Клік по кнопці виконує запит на бекенд який видаляє активну сесію користувача.
// 3. Успішна відповідь переводить користувача в статус неавторизованого, змінюючи відповідне поле в глобальному сетейті, а також обнуляє всі данні авторизованого користувача  в глобальному стейті.
// 4. Відповідь з помилкою виводить відповідне пуш-повідомлення, і вилогінює користуваача на клієнті, як і в попередньому пункті."

export const LogoutBtn = () => {
  return <div>LogoutBtn</div>;
};
