// "1. Компонент рендерить список кнопок:
//  - переміщення картки в іншу групу - відкриває контекстне меню зі списком всіх груп окрім поточної.
// Клік по кнопці зі списку виконує запит на бекенд, в якому відбувається зміна ступеню виконання задачі.
// Успіх - закривається меню і картка переміщається з поточної групи в відповідну нову.
// Помилка - юзеру показується відповідне пушповідомлення.
// - редагування картки - відкриває TaskModal - з полями заповненими даними з поточного завдання.
// - видалення картки - виконує запит на бек, який видаляє завдання.
// Успіх - завдання видаляється зі списку на сторінці, юзеру показується пушповідомлення про видалення
// Помилка - юзеру показується відповідне пушповідомлення"
import { useDeleteTaskMutation } from 'redux/tasks/tasksApi';

export const TaskToolbar = ({ task }) => {
  const [deleteTask] = useDeleteTaskMutation();

  const handleClick = async () => {
    await deleteTask(task._id);
  };

  return (
    <>
      <button type="button">Move</button>
      <button type="button">Edit</button>
      <button type="button" onClick={handleClick}>
        Delete
      </button>
    </>
  );
};
